package by.htp.les04.main;
//Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера (Таблицу ASCII). 

import java.util.Scanner;

public class Task26 {

	public static void main(String[] args) {

	  for (int i=1; i<=265; i++)
	  {
		  System.out.println(i + ": " + (char)i);
	  }
		
	    
	}}
